vlm/base/InformationRegisters/бит_СерииЭтикетокВСменномЗадании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_СерииЭтикетокВСменномЗадании</Name>
			<Comment>ЛТ5.30</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Напечатано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПроизводственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПроизводственнаяОперация2_2</v8:Type>
						<v8:Type>cfg:DocumentRef.ПроизводствоБезЗаказа</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

vlm/base/InformationRegisters/ШтрихкодыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ШтрихкодыНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

vlm/base/InformationRegisters/бит_ЗначенияПризнаковНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_ЗначенияПризнаковНоменклатуры</Name>
			<Comment>//Первыйбит ЛТ1.3 ЛапшовГ "GVLapshov@1cbit.ru" 03.02.2025</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>бит_Значение</Name>
					<Comment>//Первыйбит ЛТ1.3 ЛапшовГ "GVLapshov@1cbit.ru" 03.02.2025</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ПризнакиНоменклатуры</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>бит_Номенклатура</Name>
					<Comment>//Первыйбит ЛТ1.3 ЛапшовГ "GVLapshov@1cbit.ru" 03.02.2025</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>бит_Признак</Name>
					<Comment>//Первыйбит ЛТ1.3 ЛапшовГ "GVLapshov@1cbit.ru" 03.02.2025</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ПризнакиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>бит_ПризнакСертификации</Name>
					<Comment>//Первыйбит ЛТ1.3 ЛапшовГ "GVLapshov@1cbit.ru" 03.02.2025</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

vlm/base/InformationRegisters/бит_СерииЭтикетокВСменномЗадании/Ext/ManagerModule.bsl
Функция СформироватьДанныеДляПечатиЭтикетокИзСменногоЗадания(Структура) Экспорт
// {{ПервыйБИТ ЛистТребований [ЛТ5.30]  [VUVaynula@1cbit.ru] [19.11.2025 20:08:45] +        

	//ТабличныйДокумент = Новый ТабличныйДокумент;

	//ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЭТИКЕТКАДЛЯСМЕННОГОЗАДАНИЯ";

	ПризнакМаркаГотовойПродукции = ПолучитьЗначениеПризнака(Структура.Номенклатура, Справочники.бит_ЗначенияПоУмолчанию.ПризнакMARKA);
	ЗначениеГост = ПолучитьЗначениеПризнака(Структура.Номенклатура, Справочники.бит_ЗначенияПоУмолчанию.ПризнакГОСТ);
	ЗначениеРазмер = ПолучитьЗначениеПризнака(Структура.Номенклатура, Справочники.бит_ЗначенияПоУмолчанию.ПризнакРазмерГотовойПродукции);
	
	ДопСвойство = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.ШтампЭмалировщика, , Истина);
	ШтампЭмалировщика = УправлениеСвойствами.ЗначениеСвойства(Структура.Исполнитель, ДопСвойство);
	 
	Штрихкод = ПолучитьШтрихкодНоменклатуры46(Структура.Номенклатура);

	МашинаХод = "м. " + Структура.ВидРабочегоЦентра.Родитель + " x. " + Структура.ВидРабочегоЦентра; // ЛТ 5.36 поменял с РЦ на ВРЦ
	
	ТипЧисло10_2 = Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(10,2));
	ТипШаблон = Новый ОписаниеТипов("СправочникСсылка.ШаблоныЭтикетокИЦенников");
	ТипДата = Новый ОписаниеТипов("Дата");
	ТипСтрока1020 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(1020));
	
	ТаблицаЗначений = новый ТаблицаЗначений;
	ТаблицаЗначений.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаЗначений.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));	
	ТаблицаЗначений.Колонки.Добавить("Упаковка", Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));	 	
	ТаблицаЗначений.Колонки.Добавить("Цена", ТипЧисло10_2);	
	ТаблицаЗначений.Колонки.Добавить("ЦенаДополнительно", ТипЧисло10_2);
	ТаблицаЗначений.Колонки.Добавить("Штрихкод", ТипСтрока1020); 
	//ТаблицаЗначений.Колонки.Добавить("ШКод", ТипСтрока400); 
	ТаблицаЗначений.Колонки.Добавить("ШаблонЦенника", ТипШаблон);
	ТаблицаЗначений.Колонки.Добавить("КоличествоЦенников", ТипЧисло10_2);
	ТаблицаЗначений.Колонки.Добавить("ШаблонЭтикетки", ТипШаблон);	
	ТаблицаЗначений.Колонки.Добавить("ШаблонЭтикеткиПодготовлено", ТипШаблон);
	ТаблицаЗначений.Колонки.Добавить("КоличествоЭтикеток", ТипЧисло10_2);
	ТаблицаЗначений.Колонки.Добавить("ОстатокНаСкладе", ТипЧисло10_2);
	ТаблицаЗначений.Колонки.Добавить("КоличествоВДокументе", ТипЧисло10_2);
	ТаблицаЗначений.Колонки.Добавить("Весовой", Новый ОписаниеТипов("Булево"));	
	ТаблицаЗначений.Колонки.Добавить("ДатаПоследнегоИзмененияЦены", ТипДата);
	ТаблицаЗначений.Колонки.Добавить("ДатаПоследнегоИзмененияЦеныДополнительно", ТипДата);
	
	//ТипДопЗначениеБит = Новый ОписаниеТипов("СправочникСсылка.бит_ДополнительныеПризнакиНоменклатуры");	
	
	ТаблицаЗначений.Колонки.Добавить("МаркаГотовойПродукции", ТипСтрока1020);	  
	ТаблицаЗначений.Колонки.Добавить("НомерСерии", Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
	ТаблицаЗначений.Колонки.Добавить("ШКСерии", ТипСтрока1020); 
	ТаблицаЗначений.Колонки.Добавить("СтандартGOST", ТипСтрока1020);
	ТаблицаЗначений.Колонки.Добавить("РазмерRAZMER", ТипСтрока1020);
	ТаблицаЗначений.Колонки.Добавить("МашинаХод", ТипСтрока1020);
	ТаблицаЗначений.Колонки.Добавить("СменаДата", ТипСтрока1020);
	ТаблицаЗначений.Колонки.Добавить("ШтампЭмалировщика", ТипСтрока1020);
	
	//МассивДанныхДляПечати = Новый Массив;
	Для каждого текСерия из Структура.МассивСерий Цикл
		нов = ТаблицаЗначений.Добавить();
		нов.Номенклатура = Структура.Номенклатура;
		нов.Штрихкод = Штрихкод;
		//нов.ШКод = Штрихкод;	
		нов.КоличествоЭтикеток = 1;
		
		нов.МаркаГотовойПродукции = ПризнакМаркаГотовойПродукции;	  
		нов.НомерСерии = текСерия;
		нов.ШКСерии = Справочники.СерииНоменклатуры.СгенерироватьСтрокуШК(текСерия);
		нов.СтандартGOST = ЗначениеГост;
		нов.РазмерRAZMER = ЗначениеРазмер;
		нов.МашинаХод = МашинаХод;
		нов.СменаДата = Структура.Смена.Наименование + "/" + формат(текСерия.ДатаПроизводства, "ДФ=dd.MM.yyyy");
		нов.ШтампЭмалировщика = ШтампЭмалировщика;
	КонецЦикла;
	
	Адрес = ПоместитьВоВременноеХранилище(ТаблицаЗначений);
	
	Возврат Адрес;
// }}ПервыйБИТ ЛистТребований [ЛТ5.30]  [VUVaynula@1cbit.ru] [19.11.2025 20:08:45] -	
КонецФункции

Функция ПолучитьШтрихкодНоменклатуры46(Знач Номенклатура)
// {{ПервыйБИТ ЛистТребований [ЛТ5.30]  [VUVaynula@1cbit.ru] [22.11.2025 13:41:05] +        
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод
	                      |ИЗ
	                      |	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	                      |ГДЕ
	                      |	ШтрихкодыНоменклатуры.Номенклатура = &Номенклатура
	                      |	И ПОДСТРОКА(ШтрихкодыНоменклатуры.Штрихкод, 1, 2) = ""46""");
    Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		ШК = Выборка.Штрихкод;
	Иначе
		ШК = "";
	КонецЕсли;
	
	Возврат ШК;
// }}ПервыйБИТ ЛистТребований [ЛТ5.30]  [VUVaynula@1cbit.ru] [22.11.2025 13:41:05] -	
КонецФункции

Функция ПолучитьЗначениеПризнака(Знач Номенклатура, Знач ЭлементСправочникаПоУмолчанию)
// {{ПервыйБИТ ЛистТребований [ЛТ5.30]  [VUVaynula@1cbit.ru] [22.11.2025 13:41:05] +        
	ИскомоеЗначение = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(ЭлементСправочникаПоУмолчанию, , Истина);
	Запрос = новый Запрос("ВЫБРАТЬ
	                      |	бит_ЗначенияПризнаковНоменклатуры.бит_Значение КАК бит_Значение
	                      |ИЗ
	                      |	РегистрСведений.бит_ЗначенияПризнаковНоменклатуры КАК бит_ЗначенияПризнаковНоменклатуры
	                      |ГДЕ
	                      |	бит_ЗначенияПризнаковНоменклатуры.бит_Номенклатура = &бит_Номенклатура
	                      |	И бит_ЗначенияПризнаковНоменклатуры.бит_Признак = &бит_Признак");
	Запрос.УстановитьПараметр("бит_Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("бит_Признак", ИскомоеЗначение);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.бит_Значение;
	Иначе 
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
// }}ПервыйБИТ ЛистТребований [ЛТ5.30]  [VUVaynula@1cbit.ru] [22.11.2025 13:41:05] -	
 КонецФункции
